FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_usart.c
    /* check arguments */
    assert( !( ( NULL == base ) || ( NULL == config ) || ( 0U == srcClock_Hz ) ) );

    if( ( NULL == base ) || ( NULL == config ) || ( 0U == srcClock_Hz ) )
    {
        return kStatus_InvalidArgument;
    }

    /* initialize flexcomm to USART mode */
    result = FLEXCOMM_Init( base, FLEXCOMM_PERIPH_USART );

    if( kStatus_Success != result )
    {
        return result;
    }

    if( config->enableTx )
    {
        /* empty and enable txFIFO */
        base->FIFOCFG |= USART_FIFOCFG_EMPTYTX_MASK | USART_FIFOCFG_ENABLETX_MASK;
        /* setup trigger level */
        base->FIFOTRIG &= ~( USART_FIFOTRIG_TXLVL_MASK );
        base->FIFOTRIG |= USART_FIFOTRIG_TXLVL( config->txWatermark );
        /* enable trigger interrupt */
        base->FIFOTRIG |= USART_FIFOTRIG_TXLVLENA_MASK;
    }

    /* empty and enable rxFIFO */
    if( config->enableRx )
    {
        base->FIFOCFG |= USART_FIFOCFG_EMPTYRX_MASK | USART_FIFOCFG_ENABLERX_MASK;
        /* setup trigger level */
        base->FIFOTRIG &= ~( USART_FIFOTRIG_RXLVL_MASK );
        base->FIFOTRIG |= USART_FIFOTRIG_RXLVL( config->rxWatermark );
        /* enable trigger interrupt */
        base->FIFOTRIG |= USART_FIFOTRIG_RXLVLENA_MASK;
    }

    #if defined( FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG ) && FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG
        USART_SetRxTimeoutConfig( base, ( usart_rx_timeout_config * ) &( config->rxTimeout ) );
    #endif
    /* setup configuration and enable USART */
    base->CFG = USART_CFG_PARITYSEL( config->parityMode ) | USART_CFG_STOPLEN( config->stopBitCount ) |
                USART_CFG_DATALEN( config->bitCountPerChar ) | USART_CFG_LOOP( config->loopback ) |
                USART_CFG_SYNCEN( ( uint32_t ) config->syncMode >> 1 ) | USART_CFG_SYNCMST( ( uint8_t ) config->syncMode ) |
                USART_CFG_CLKPOL( config->clockPolarity ) | USART_CFG_MODE32K( config->enableMode32k ) |
                USART_CFG_CTSEN( config->enableHardwareFlowControl ) | USART_CFG_ENABLE_MASK;

    /* Setup baudrate */
    if( config->enableMode32k )
    {
        if( ( 9600U % config->baudRate_Bps ) == 0U )
        {
            base->BRG = 9600U / config->baudRate_Bps;
        }
        else
        {
            return kStatus_USART_BaudrateNotSupport;
        }
    }
    else
    {
        result = USART_SetBaudRate( base, config->baudRate_Bps, srcClock_Hz );

        if( kStatus_Success != result )
        {
            return result;
        }
    }

    /* Setting continuous Clock configuration. used for synchronous mode. */
    USART_EnableContinuousSCLK( base, config->enableContinuousSCLK );

    return kStatus_Success;
}

/*!
 * brief Deinitializes a USART instance.
 *
 * This function waits for TX complete, disables TX and RX, and disables the USART clock.
 *
 * param base USART peripheral base address.
 */
void USART_Deinit( USART_Type * base )
{
    /* Check arguments */
    assert( NULL != base );

    while( 0U == ( base->STAT & USART_STAT_TXIDLE_MASK ) )
    {
    }

    /* Disable interrupts, disable dma requests, disable peripheral */
    base->FIFOINTENCLR = USART_FIFOINTENCLR_TXERR_MASK | USART_FIFOINTENCLR_RXERR_MASK | USART_FIFOINTENCLR_TXLVL_MASK |
                         USART_FIFOINTENCLR_RXLVL_MASK;
    base->FIFOCFG &= ~( USART_FIFOCFG_DMATX_MASK | USART_FIFOCFG_DMARX_MASK );
    base->CFG &= ~( USART_CFG_ENABLE_MASK );
    #if defined( FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG ) && FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG
        base->FIFORXTIMEOUTCFG = 0U;
    #endif
}

/*!
 * brief Gets the default configuration structure.
 *
 * This function initializes the USART configuration structure to a default value. The default
 * values are:
 *   usartConfig->baudRate_Bps = 115200U;
 *   usartConfig->parityMode = kUSART_ParityDisabled;
 *   usartConfig->stopBitCount = kUSART_OneStopBit;
 *   usartConfig->bitCountPerChar = kUSART_8BitsPerChar;
 *   usartConfig->loopback = false;
 *   usartConfig->enableTx = false;
 *   usartConfig->enableRx = false;
 *
 * param config Pointer to configuration structure.
 */
void USART_GetDefaultConfig( usart_config_t * config )
{
    /* Check arguments */
    assert( NULL != config );

    /* Initializes the configure structure to zero. */
    ( void ) memset( config, 0, sizeof( *config ) );

    /* Set always all members ! */
    config->baudRate_Bps = 115200U;
    config->parityMode = kUSART_ParityDisabled;
    config->stopBitCount = kUSART_OneStopBit;
    config->bitCountPerChar = kUSART_8BitsPerChar;
    config->loopback = false;
    config->enableRx = false;
    config->enableTx = false;
    config->enableMode32k = false;
    config->txWatermark = kUSART_TxFifo0;
    config->rxWatermark = kUSART_RxFifo1;
    config->syncMode = kUSART_SyncModeDisabled;
    config->enableContinuousSCLK = false;
    config->clockPolarity = kUSART_RxSampleOnFallingEdge;
    config->enableHardwareFlowControl = false;
    #if defined( FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG ) && FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG
        config->rxTimeout.enable = false;
        config->rxTimeout.resetCounterOnEmpty = true;
        config->rxTimeout.resetCounterOnReceive = true;
        config->rxTimeout.counter = 0U;
        config->rxTimeout.prescaler = 0U;
    #endif
}
#if defined( FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG ) && FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG

/*!
 * brief Calculate the USART instance RX timeout prescaler and counter.
 *
 * This function for calculate the USART RXFIFO timeout config. This function is used to calculate
 * suitable prescaler and counter for target_us.
 * Example below shows how to use this API to configure USART.
 * code
 *   usart_config_t config;
 *   config.rxWatermark                     = kUSART_RxFifo2;
 *   config.rxTimeout.enable                = true;
 *   config.rxTimeout.resetCounterOnEmpty   = true;
 *   config.rxTimeout.resetCounterOnReceive = true;
 *   USART_CalcTimeoutConfig(200, &config.rxTimeout.prescaler, &config.rxTimeout.counter,
 *                                    CLOCK_GetFreq(kCLOCK_BusClk));
 * endcode
 * param target_us  Time for rx timeout unit us.
 * param rxTimeoutPrescaler The prescaler to be setted after function.
 * param rxTimeoutcounter The counter to be setted after function.
 * param srcClock_Hz The clockSrc for rx timeout.
 */
    void USART_CalcTimeoutConfig( uint32_t target_us,
                                  uint8_t * rxTimeoutPrescaler,
                                  uint32_t * rxTimeoutcounter,
                                  uint32_t srcClock_Hz )
    {
        uint16_t counter = 0U;
        uint32_t perscalar = 0U, calculate_us = 0U, us_diff = 0U, min_diff = 0xffffffffUL;

        /* find the suitable value */
        for( perscalar = 0U; perscalar < 256U; perscalar++ )
        {
            counter = target_us * ( srcClock_Hz / 1000000UL ) / ( 16U * ( perscalar + 1U ) );
            calculate_us = 16U * ( perscalar + 1U ) * counter / ( srcClock_Hz / 1000000UL );
            us_diff = ( calculate_us > target_us ) ? ( calculate_us - target_us ) : ( target_us - calculate_us );

            if( us_diff == 0U )
            {
                *rxTimeoutPrescaler = perscalar;
                *rxTimeoutcounter = counter;
                break;
            }
            else
            {
                if( min_diff > us_diff )
                {
                    min_diff = us_diff;
                    *rxTimeoutPrescaler = perscalar;
                    *rxTimeoutcounter = counter;
                }
            }
        }
    }

/*!
 * brief Sets the USART instance RX timeout config.
 *
 * This function configures the USART RXFIFO timeout config. This function is used to config
 * the USART RXFIFO timeout config after the USART module is initialized by the USART_Init.
 *
 * param base USART peripheral base address.
 * param config pointer to receive timeout configuration structure.
 */
    void USART_SetRxTimeoutConfig( USART_Type * base,
                                   usart_rx_timeout_config * config )
    {
        base->FIFORXTIMEOUTCFG = 0U;
        base->FIFORXTIMEOUTCFG = USART_FIFORXTIMEOUTCFG_RXTIMEOUT_COW( ~config->resetCounterOnReceive ) |
                                 USART_FIFORXTIMEOUTCFG_RXTIMEOUT_COE( ~config->resetCounterOnEmpty ) |
                                 USART_FIFORXTIMEOUTCFG_RXTIMEOUT_EN( config->enable ) |
                                 USART_FIFORXTIMEOUTCFG_RXTIMEOUT_VALUE( config->counter ) |
                                 USART_FIFORXTIMEOUTCFG_RXTIMEOUT_PRESCALER( config->prescaler );
    }
#endif /* if defined( FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG ) && FSL_FEATURE_USART_HAS_FIFORXTIMEOUTCFG */

/*!
 * brief Sets the USART instance baud rate.
 *
 * This function configures the USART module baud rate. This function is used to update
 * the USART module baud rate after the USART module is initialized by the USART_Init.
 * code
 *  USART_SetBaudRate(USART1, 115200U, 20000000U);
 * endcode
 *
 * param base USART peripheral base address.
 * param baudrate_Bps USART baudrate to be set.
 * param srcClock_Hz USART clock source frequency in HZ.
 * retval kStatus_USART_BaudrateNotSupport Baudrate is not support in current clock source.
 * retval kStatus_Success Set baudrate succeed.
 * retval kStatus_InvalidArgument One or more arguments are invalid.
 */
status_t USART_SetBaudRate( USART_Type * base,
                            uint32_t baudrate_Bps,
                            uint32_t srcClock_Hz )
{
    uint32_t best_diff = ( uint32_t ) -1, best_osrval = 0xf, best_brgval = ( uint32_t ) -1;
    uint32_t osrval, brgval, diff, baudrate, allowed_error;

