FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_usart.c
    /* check arguments */
    assert( !( ( NULL == base ) || ( 0U == baudrate_Bps ) || ( 0U == srcClock_Hz ) ) );

    if( ( NULL == base ) || ( 0U == baudrate_Bps ) || ( 0U == srcClock_Hz ) )
    {
        return kStatus_InvalidArgument;
    }

    /* If synchronous master mode is enabled, only configure the BRG value. */
    if( ( base->CFG & USART_CFG_SYNCEN_MASK ) != 0U )
    {
        if( ( base->CFG & USART_CFG_SYNCMST_MASK ) != 0U )
        {
            brgval = srcClock_Hz / baudrate_Bps;
            base->BRG = brgval - 1U;
        }
    }
    else
    {
        /* Actual baud rate must be within 3% of desired baud rate based on the calculated OSR and BRG value */
        allowed_error = ( ( baudrate_Bps / 100U ) * 3U );

        /*
         * Smaller values of OSR can make the sampling position within a data bit less accurate and may
         * potentially cause more noise errors or incorrect data.
         */
        for( osrval = best_osrval; ( osrval >= 4U ); osrval-- )
        {
            /* Break if the best baudrate's diff is in the allowed error range and the osrval is below 8,
             * only use lower osrval if the baudrate cannot be obtained with an osrval of 8 or above. */
            if( ( osrval <= 8U ) && ( best_diff <= allowed_error ) )
            {
                break;
            }

            brgval = ( ( ( srcClock_Hz * 10U ) / ( ( osrval + 1U ) * baudrate_Bps ) ) - 5U ) / 10U;

            if( brgval > 0xFFFFU )
            {
                continue;
            }

            baudrate = srcClock_Hz / ( ( osrval + 1U ) * ( brgval + 1U ) );
            diff = ( baudrate_Bps < baudrate ) ? ( baudrate - baudrate_Bps ) : ( baudrate_Bps - baudrate );

            if( diff < best_diff )
            {
                best_diff = diff;
                best_osrval = osrval;
                best_brgval = brgval;
            }
        }

        /* Check to see if actual baud rate is within 3% of desired baud rate
         * based on the best calculated OSR and BRG value */
        baudrate = srcClock_Hz / ( ( best_osrval + 1U ) * ( best_brgval + 1U ) );
        diff = ( baudrate_Bps < baudrate ) ? ( baudrate - baudrate_Bps ) : ( baudrate_Bps - baudrate );

        if( diff > allowed_error )
        {
            return kStatus_USART_BaudrateNotSupport;
        }

        /* value over range */
        if( best_brgval > 0xFFFFU )
        {
            return kStatus_USART_BaudrateNotSupport;
        }

        base->OSR = best_osrval;
        base->BRG = best_brgval;
    }

    return kStatus_Success;
}

/*!
 * brief Enable 32 kHz mode which USART uses clock from the RTC oscillator as the clock source.
 *
 * Please note that in order to use a 32 kHz clock to operate USART properly, the RTC oscillator
 * and its 32 kHz output must be manully enabled by user, by calling RTC_Init and setting
 * SYSCON_RTCOSCCTRL_EN bit to 1.
 * And in 32kHz clocking mode the USART can only work at 9600 baudrate or at the baudrate that
 * 9600 can evenly divide, eg: 4800, 3200.
 *
 * param base USART peripheral base address.
 * param baudRate_Bps USART baudrate to be set..
 * param enableMode32k true is 32k mode, false is normal mode.
 * param srcClock_Hz USART clock source frequency in HZ.
 * retval kStatus_USART_BaudrateNotSupport Baudrate is not support in current clock source.
 * retval kStatus_Success Set baudrate succeed.
 * retval kStatus_InvalidArgument One or more arguments are invalid.
 */
status_t USART_Enable32kMode( USART_Type * base,
                              uint32_t baudRate_Bps,
                              bool enableMode32k,
                              uint32_t srcClock_Hz )
{
    status_t result = kStatus_Success;

    base->CFG &= ~( USART_CFG_ENABLE_MASK );

    if( enableMode32k )
    {
        base->CFG |= USART_CFG_MODE32K_MASK;

        if( ( 9600U % baudRate_Bps ) == 0U )
        {
            base->BRG = 9600U / baudRate_Bps - 1U;
        }
        else
        {
            return kStatus_USART_BaudrateNotSupport;
        }
    }
    else
    {
        base->CFG &= ~( USART_CFG_MODE32K_MASK );
        result = USART_SetBaudRate( base, baudRate_Bps, srcClock_Hz );

        if( kStatus_Success != result )
        {
            return result;
        }
    }

    base->CFG |= USART_CFG_ENABLE_MASK;
    return result;
}

/*!
 * brief Enable 9-bit data mode for USART.
 *
 * This function set the 9-bit mode for USART module. The 9th bit is not used for parity thus can be modified by user.
 *
 * param base USART peripheral base address.
 * param enable true to enable, false to disable.
 */
void USART_Enable9bitMode( USART_Type * base,
                           bool enable )
{
    assert( base != NULL );

    uint32_t temp = 0U;

    if( enable )
    {
        /* Set USART 9-bit mode, disable parity. */
        temp = base->CFG & ~( ( uint32_t ) USART_CFG_DATALEN_MASK | ( uint32_t ) USART_CFG_PARITYSEL_MASK );
        temp |= ( uint32_t ) USART_CFG_DATALEN( 0x2U );
        base->CFG = temp;
    }
    else
    {
        /* Set USART to 8-bit mode. */
        base->CFG &= ~( ( uint32_t ) USART_CFG_DATALEN_MASK );
        base->CFG |= ( uint32_t ) USART_CFG_DATALEN( 0x1U );
    }
}

/*!
 * brief Transmit an address frame in 9-bit data mode.
 *
 * param base USART peripheral base address.
 * param address USART slave address.
 */
void USART_SendAddress( USART_Type * base,
                        uint8_t address )
{
    assert( base != NULL );
    base->FIFOWR = ( ( uint32_t ) address | 0x100UL );
}

/*!
 * brief Writes to the TX register using a blocking method.
 *
 * This function polls the TX register, waits for the TX register to be empty or for the TX FIFO
 * to have room and writes data to the TX buffer.
 *
 * param base USART peripheral base address.
 * param data Start address of the data to write.
 * param length Size of the data to write.
 * retval kStatus_USART_Timeout Transmission timed out and was aborted.
 * retval kStatus_InvalidArgument Invalid argument.
 * retval kStatus_Success Successfully wrote all data.
 */
status_t USART_WriteBlocking( USART_Type * base,
                              const uint8_t * data,
                              size_t length )
{
    /* Check arguments */
    assert( !( ( NULL == base ) || ( NULL == data ) ) );
    #if UART_RETRY_TIMES
        uint32_t waitTimes;
    #endif

    if( ( NULL == base ) || ( NULL == data ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Check whether txFIFO is enabled */
    if( 0U == ( base->FIFOCFG & USART_FIFOCFG_ENABLETX_MASK ) )
    {
        return kStatus_InvalidArgument;
    }

    for( ; length > 0U; length-- )
    {
        /* Loop until txFIFO get some space for new data */
        #if UART_RETRY_TIMES
            waitTimes = UART_RETRY_TIMES;

            while( ( 0U == ( base->FIFOSTAT & USART_FIFOSTAT_TXNOTFULL_MASK ) ) && ( --waitTimes != 0U ) )
        #else
            while( 0U == ( base->FIFOSTAT & USART_FIFOSTAT_TXNOTFULL_MASK ) )
        #endif
        {
        }

