FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_usart.c
    /* Check arguments */
    assert( !( ( NULL == base ) || ( NULL == handle ) || ( NULL == xfer ) ) );

    if( ( NULL == base ) || ( NULL == handle ) || ( NULL == xfer ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Check xfer members */
    assert( !( ( 0U == xfer->dataSize ) || ( NULL == xfer->rxData ) ) );

    if( ( 0U == xfer->dataSize ) || ( NULL == xfer->rxData ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Enable address detect when address match is enabled. */
    if( ( base->CFG & ( uint32_t ) USART_CFG_AUTOADDR_MASK ) != 0U )
    {
        base->CTL |= ( uint32_t ) USART_CTL_ADDRDET_MASK;
    }

    /* How to get data:
     * 1. If RX ring buffer is not enabled, then save xfer->data and xfer->dataSize
     *    to uart handle, enable interrupt to store received data to xfer->data. When
     *    all data received, trigger callback.
     * 2. If RX ring buffer is enabled and not empty, get data from ring buffer first.
     *    If there are enough data in ring buffer, copy them to xfer->data and return.
     *    If there are not enough data in ring buffer, copy all of them to xfer->data,
     *    save the xfer->data remained empty space to uart handle, receive data
     *    to this empty space and trigger callback when finished. */
    if( ( uint8_t ) kUSART_RxBusy == handle->rxState )
    {
        return kStatus_USART_RxBusy;
    }
    else
    {
        bytesToReceive = xfer->dataSize;
        bytesCurrentReceived = 0U;

        /* If RX ring buffer is used. */
        if( handle->rxRingBuffer != NULL )
        {
            /* Disable IRQ, protect ring buffer. */
            interruptMask = USART_GetEnabledInterrupts( base );
            USART_DisableInterrupts( base, interruptMask );

            /* How many bytes in RX ring buffer currently. */
            bytesToCopy = USART_TransferGetRxRingBufferLength( handle );

            if( bytesToCopy != 0U )
            {
                bytesToCopy = MIN( bytesToReceive, bytesToCopy );
                bytesToReceive -= bytesToCopy;

                /* Copy data from ring buffer to user memory. */
                for( i = 0U; i < bytesToCopy; i++ )
                {
                    xfer->rxData[ bytesCurrentReceived++ ] = handle->rxRingBuffer[ handle->rxRingBufferTail ];

                    /* Wrap to 0. Not use modulo (%) because it might be large and slow. */
                    if( ( size_t ) handle->rxRingBufferTail + 1U == handle->rxRingBufferSize )
                    {
                        handle->rxRingBufferTail = 0U;
                    }
                    else
                    {
                        handle->rxRingBufferTail++;
                    }
                }
            }

            /* If ring buffer does not have enough data, still need to read more data. */
            if( bytesToReceive != 0U )
            {
                /* No data in ring buffer, save the request to UART handle. */
                handle->rxData = xfer->rxData + bytesCurrentReceived;
                handle->rxDataSize = bytesToReceive;
                handle->rxDataSizeAll = xfer->dataSize;
                handle->rxState = ( uint8_t ) kUSART_RxBusy;
            }

            /* Re-enable IRQ. */
            USART_EnableInterrupts( base, interruptMask );

            /* Call user callback since all data are received. */
            if( 0U == bytesToReceive )
            {
                if( handle->callback != NULL )
                {
                    handle->callback( base, handle, kStatus_USART_RxIdle, handle->userData );
                }
            }
        }
        /* Ring buffer not used. */
        else
        {
            /* Disable IRQ when configuring transfer handle, in case interrupt occurs during the process and messes up
             * the handle value. */
            interruptMask = USART_GetEnabledInterrupts( base );
            USART_DisableInterrupts( base, interruptMask );
            handle->rxData = xfer->rxData + bytesCurrentReceived;
            handle->rxDataSize = bytesToReceive;
            handle->rxDataSizeAll = bytesToReceive;
            handle->rxState = ( uint8_t ) kUSART_RxBusy;

            /* Enable RX interrupt. */
            base->FIFOINTENSET = USART_FIFOINTENSET_RXLVL_MASK;
            /* Re-enable IRQ. */
            USART_EnableInterrupts( base, interruptMask );
        }

        /* Return the how many bytes have read. */
        if( receivedBytes != NULL )
        {
            *receivedBytes = bytesCurrentReceived;
        }
    }

    return kStatus_Success;
}

/*!
 * brief Aborts the interrupt-driven data receiving.
 *
 * This function aborts the interrupt-driven data receiving. The user can get the remainBytes to find out
 * how many bytes not received yet.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 */
void USART_TransferAbortReceive( USART_Type * base,
                                 usart_handle_t * handle )
{
    assert( NULL != handle );

    /* Only abort the receive to handle->rxData, the RX ring buffer is still working. */
    if( NULL == handle->rxRingBuffer )
    {
        /* Disable interrupts */
        USART_DisableInterrupts( base, ( uint32_t ) kUSART_RxLevelInterruptEnable );
        /* Empty rxFIFO */
        base->FIFOCFG |= USART_FIFOCFG_EMPTYRX_MASK;
    }

    handle->rxDataSize = 0U;
    handle->rxState = ( uint8_t ) kUSART_RxIdle;
}

/*!
 * brief Get the number of bytes that have been received.
 *
 * This function gets the number of bytes that have been received.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 * param count Receive bytes count.
 * retval kStatus_NoTransferInProgress No receive in progress.
 * retval kStatus_InvalidArgument Parameter is invalid.
 * retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t USART_TransferGetReceiveCount( USART_Type * base,
                                        usart_handle_t * handle,
                                        uint32_t * count )
{
    assert( NULL != handle );
    assert( NULL != count );

    if( ( uint8_t ) kUSART_RxIdle == handle->rxState )
    {
        return kStatus_NoTransferInProgress;
    }

    *count = handle->rxDataSizeAll - handle->rxDataSize;

    return kStatus_Success;
}

/*!
 * brief USART IRQ handle function.
 *
 * This function handles the USART transmit and receive IRQ request.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 */
void USART_TransferHandleIRQ( USART_Type * base,
                              usart_handle_t * handle )
{
    /* Check arguments */
    assert( ( NULL != base ) && ( NULL != handle ) );

    bool receiveEnabled = ( ( handle->rxDataSize != 0U ) || ( handle->rxRingBuffer != NULL ) );
    bool sendEnabled = ( handle->txDataSize != 0U );
    uint8_t rxdata;
    size_t tmpsize;

